---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceBackgroundPatternId
source: html/e3837120-6205-c990-5151-885c0099e2b4.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceBackgroundPatternId Property

The ElementId of the surface background fill pattern override.
 A value of InvalidElementId means no override is set.

## Syntax (C#)
```csharp
public ElementId SurfaceBackgroundPatternId { get; }
```